package controller

import (
	"eebot/bot/service"
	"errors"
	"fmt"
	"strings"
)

// AnalysisPal
//
//	rawMessageSlice[0]: pal name
func AnalysisPal(rawMessageSlice []string, isGroup bool, sourceID int64, targetID int64) (err error) {
	var prefix string
	if isGroup {
		prefix = fmt.Sprintf("[CQ:at,qq=%d] \n", sourceID)
	}
	if len(rawMessageSlice) < 1 {
		service.Reply("必须指定帕鲁名称", prefix, targetID)
		return errors.New("必须指定帕鲁名称")
	}
	for name, equals := range illustration {
		if strings.Contains(name, rawMessageSlice[1]) {
			suffix := ""
			for i := range equals {
				suffix += equals[i] + "\n"
			}
			return service.Reply(suffix, prefix, targetID)
		}
	}
	suffix := fmt.Sprintf("不存在的帕鲁 %s，或尚未发现的公式", rawMessageSlice[1])
	return service.Reply(suffix, prefix, targetID)
}

func init() {
	slices := strings.Split(data, "\n")
	// fmt.Printf("slices: %v\n", slices)
	for i := range slices {
		illustration[strings.Split(slices[i], "＝")[1]] = append(illustration[strings.Split(slices[i], "＝")[1]], slices[i])
	}
}

var illustration map[string][]string = map[string][]string{}

var data = `1.棉悠悠+棉悠悠＝棉悠悠
2.棉悠悠+捣蛋猫＝棉悠悠
3.棉悠悠+皮皮鸡＝喵斯特
4.棉悠悠+翠叶鼠＝玉藻狐
5.棉悠悠+火绒狐＝翠叶鼠
6.棉悠悠+冲浪鸭＝火绒狐
7.棉悠悠+伏特喵＝翠叶鼠
8.棉悠悠+新叶猿＝电棘鼠
9.棉悠悠+燎火鹿＝姬小兔
10.棉悠悠+企丸丸＝伏特喵
11.棉悠悠+企丸王＝踏春兔
12.棉悠悠+电棘鼠＝吊缚灵
12B.棉悠悠+冰刺鼠＝吊缚灵
13.棉悠悠+叶泥泥＝企丸丸
14.棉悠悠+玉藻狐＝捣蛋猫
15.棉悠悠+啼卡尔＝翠叶鼠
16.棉悠悠+壶小象＝喵斯特
17.棉悠悠+瞅什魔＝翠叶鼠
18.棉悠悠+米露菲＝捣蛋猫
19.棉悠悠+寐魔＝企丸丸
20.棉悠悠+草莽猪＝毛掸儿
21.棉悠悠+露娜蒂＝荆棘魔仙
22.棉悠悠+遁地鼠＝炸蛋鸟
23.棉悠悠+勾魂鱿＝瞅什魔
24.棉悠悠+喵斯特＝喵斯特
24B.棉悠悠+冰丝特＝米露菲
25.棉悠悠+鲁米儿＝焰巫狐
26.棉悠悠+猎狼＝水灵儿
27.棉悠悠+炸蛋鸟＝融焰娘
28.棉悠悠+波娜兔＝电棘鼠
29.棉悠悠+波霸牛＝棉花糖
30.棉悠悠+荆棘魔仙＝火绒狐
31.棉悠悠+鲨小子＝波娜兔
31B.棉悠悠+红小鲨＝勾魂鱿
32.棉悠悠+吊缚灵＝玉藻狐
32B.棉悠悠+冰缚灵＝玉藻狐
33.棉悠悠+叶胖达＝月镰魔
33B.棉悠悠+雷胖达＝灌木羊
34.棉悠悠+棉花糖＝冲浪鸭
35.棉悠悠+灌木羊＝雷鸣童子
36.棉悠悠+美露帕＝露娜蒂
37.棉悠悠+紫霞鹿＝棉花糖
37B.棉悠悠+祇岳鹿＝棉花糖
38.棉悠悠+疾风隼＝月镰魔
39.棉悠悠+姬小兔＝啼卡尔
40.棉悠悠+炎魔羊＝天擒鸟
40B.棉悠悠+暗魔羊＝天擒鸟
41.棉悠悠+幻悦蝶＝云海鹿
42.棉悠悠+炽焰牛＝草莽猪
43.棉悠悠+趴趴鲶＝露娜蒂
44.棉悠悠+黑鸦隐士＝火灵儿
45.棉悠悠+朋克蜥＝勾魂鱿
45B.棉悠悠+热血蜥＝毛掸儿
46.棉悠悠+月镰魔＝雷鸣童子
47.棉悠悠+天擒鸟＝新叶猿
48.棉悠悠+羽箭射手＝新叶猿
48B.棉悠悠+山岳射手＝寐魔
49.棉悠悠+铁拳猿＝水灵儿
50.棉悠悠+骑士蜂＝火灵儿
51.棉悠悠+女王蜂＝趴趴鲶
52.棉悠悠+笑魇猫＝踏春兔
53.棉悠悠+毛掸儿＝瞅什魔
54.棉悠悠+毛老爹＝博爱蜥
55.棉悠悠+疾旋鼬＝草莽猪
56.棉悠悠+雷角马＝黑鸦隐士
57.棉悠悠+吹雪狐＝秘斯媞雅
58.棉悠悠+火麒麟＝紫霞鹿
58B.棉悠悠+邪麒麟＝碎岩龟
59.棉悠悠+严冬鹿＝露娜蒂
60.棉悠悠+霹雳犬＝秘斯媞雅
61.棉悠悠+苍焰狼＝噬魂兽
62.棉悠悠+雷鸣童子＝炸蛋鸟
63.棉悠悠+秘斯媞雅＝勾魂鱿
64.棉悠悠+花冠龙＝噬魂兽
64B.棉悠悠+雷冠龙＝草莽猪
65.棉悠悠+划水蛇＝羽箭射手
65B.棉悠悠+流沙蛇＝夜幕魔蝠
66.棉悠悠+噬魂兽＝姬小兔
67.棉悠悠+碎岩龟＝焰巫狐
68.棉悠悠+猫蝠怪＝秘斯媞雅
69.棉悠悠+博爱蜥＝雷鸣童子
70.棉悠悠+融焰娘＝翠叶鼠
71.棉悠悠+烽歌龙＝猎狼
71B.棉悠悠+霜歌龙＝铁拳猿
72.棉悠悠+浪忍武士＝猎狼
73.棉悠悠+迅雷鸟＝碎岩龟
74.棉悠悠+烽火鸟＝紫霞鹿
75.棉悠悠+暗巫猫＝鲨小子
76.棉悠悠+焰巫狐＝荆棘魔仙
77.棉悠悠+踏春兔＝寐魔
78.棉悠悠+薇莉塔＝水灵儿
79.棉悠悠+绸笠蛾＝月镰魔
80.棉悠悠+精灵龙＝夜幕魔蝠
81.棉悠悠+水灵儿＝电棘鼠
81B.棉悠悠+火灵儿＝电棘鼠
82.棉悠悠+碧海龙＝云海鹿
83.棉悠悠+冰棘兽＝疾旋鼬
84.棉悠悠+狱焰王＝鲨小子
84B.棉悠悠+狱阎王＝骑士蜂
85.棉悠悠+佩克龙＝严冬鹿
85B.棉悠悠+派克龙＝鲁米儿
86.棉悠悠+连理龙＝焰巫狐
86B.棉悠悠+海誓龙＝燎火鹿
87.棉悠悠+花丽娜＝草莽猪
88.棉悠悠+熔岩兽＝趴趴鲶
88B.棉悠悠+寒霜兽＝碎岩龟
89.棉悠悠+君王美露帕＝云海鹿
89B.棉悠悠+冰帝美露帕＝月镰魔
90.棉悠悠+森猛犸＝美露帕
90B.棉悠悠+雪猛犸＝严冬鹿
91.棉悠悠+白绒雪怪＝月镰魔
91B.棉悠悠+绿苔绒怪＝云海鹿
92.棉悠悠+铠格力斯＝波霸牛
93.棉悠悠+云海鹿＝地道鼠
94.棉悠悠+夜幕魔蝠＝叶泥泥
95.棉悠悠+天羽龙＝波霸牛
96.棉悠悠+焰煌＝霹雳犬
97.棉悠悠+雷冥鸟＝苍焰狼
98.棉悠悠+魔渊龙＝花冠龙
99.棉悠悠+冥铠蝎＝连理龙
100.棉悠悠+阿努比斯＝羽箭射手
101.棉悠悠+覆海龙＝美露帕
101B.棉悠悠+腾炎龙＝趴趴鲶
102.棉悠悠+朱雀＝喷雪狐
102B.棉悠悠+清雀＝猫蝠怪
103.棉悠悠+暴电熊＝苍焰狼
104.棉悠悠+百合女王＝连理龙
104B.棉悠悠+黑月女王＝碎岩龟
105.棉悠悠+荷鲁斯＝紫霞鹿
106.棉悠悠+波鲁杰克斯＝疾旋鼬`
